[{
"title": "Chapter 1: General Information",
"url": "/01-general-information.html",
"text": "Chapter 1: General Information"
}
,{
"title": "(A) Overview of Community Disputes Resolution Tribunals (CDRT)",
"url": "/01-general-information.html#a-overview-of-community-disputes-resolution-tribunals-cdrt",
"text": "(A) Overview of Community Disputes Resolution Tribunals (CDRT) Background The Community Disputes Resolution Act (CDRA) creates a new statutory tort of interfering with the enjoyment or use of places of residence. The underlying principle is that no person should cause unreasonable interference with his neighbour’s enjoyment or use of that neighbour’s place of residence. The CDRA also establishes the Community Disputes Resolution Tribunals (CDRT) as part of the State Courts to hear cases under the CDRA. The CDRA only applies to acts committed on or after the date it came into force (1 October 2015). Who is my neighbour? /&lt;/Insert picture here/&gt; Your neighbour is a person who: Lives in the same building as you; or Lives within a 100 metre radius of your place of residence. Your neighbour does NOT include a person who lives in the same place of residence as you. Examples of interference /&lt;/Insert picture here/&gt; Evidence that may be brought before the CDRT You will need to present proof (or evidence) to support your claim. The proof can be in written form, photographs, pictures, or audio/video recordings /&lt;/Insert picture here/&gt; Court orders that the CDRT can make /"
}
,{
"title": "(B) Before filing a Claim – Self-help remedies",
"url": "/01-general-information.html#b-before-filing-a-claim--self-help-remedies",
"text": "(B) Before filing a Claim – Self-help remedies Neighbours should consider starting proceedings in the CDRT only after all self-help options, including community mediation, have been attempted and exhausted. Initiating proceedings in the CDRT against your neighbour should always be the last option unless all other means of resolving the dispute have not been effective. To better understand the self-help options that are available to you, you may wish to refer to the following websites: Guidelines on Resolving Neighbour Disputes The Community Dispute Management Framework https://www.mccy.gov.sg/en/Topics/Community/Articles/Community_Dispute.aspx Guidelines for Resolving Disputes Between Neighbours https://www.mccy.gov.sg/en/Topics/Community/Articles/Resolving_Neighbourly_Disputes.aspx Mediation Community Mediation Centre (CMC) https://www.mlaw.gov.sg/content/cmc/en.html Assistance from People’s Association Legal Advice Service https://www.pa.gov.sg/our-network/community-clubs/legal-advice-service Assistance from Town Councils www.towncouncils.sg Assistance from Relevant Government Agencies Agri-Food &amp; Veterinary Authority of Singapore (AVA) Building and Construction Authority (BCA) Housing &amp; Development Board (HDB) Land Transport Authority (LTA) National Environment Agency (NEA) PUB, The National Water Agency (PUB) Urban Redevelopment Authority (URA) Singapore Police Force (SPF) Singapore Civil Defence Force (SCDF)"
}
,{
"title": "(C) Community Disputes Resolution Tribunals Process Flowchart",
"url": "/01-general-information.html#c-community-disputes-resolution-tribunals-process-flowchart",
"text": "(C) Community Disputes Resolution Tribunals Process Flowchart /&lt;/Insert picture here/&gt;"
}
,{
"title": "(D) Features of CDRT",
"url": "/01-general-information.html#d-features-of-cdrt",
"text": "(D) Features of CDRT The CDRA prescribes certain unique features for proceedings in the CDRT which are meant to simplify the processes, ensures that fees are affordable and enables members of the public to represent themselves in the proceedings without the assistance of lawyers. PRE-FILING ASSESSMENT A plaintiff is required to log on to the State Courts online electronic filing system (“CJTS”) at website www.statecourts.gov.sg/CJTS/ and undergo a pre-filing assessment before lodging any claim. PRESENT YOUR OWN CASE Lawyers are not allowed to represent a party to the proceedings (section 29(3)). The only exception is when all parties to the proceedings agree for a party to be represented by a lawyer and the CDRT gives permission (section 29(3)(b)). As a general rule, a party to the proceedings must present his or her own case during the CDRT proceedings (section 29(1)). There are, however, some exceptions to this general rule. A party to the proceedings may be represented by another person in the following situations, provided that the CDRT is satisfied that the person has sufficient knowledge of the case and sufficient authority to bind the party whom he represents (section 29(5)): SITUATION The party is below 21 years old; and The CDRT is of the opinion that he is unable to present his own case. (Section 29(2)(a)) Who can represent the party? - The party’s parent; - The party’s guardian; or - A person who is approved by the CDRT. SITUATION The party is not living in Singapore; and the party is unable to remain in Singapore until the hearing of the case. (Section 29(2)(b)) Who can represent the party? A person: - who is authorised in writing by the party; and - who is approved by the CDRT. SITUATION The CDRT is of the opinion that the party is unable to present his own case because he is: - old; - illiterate; - mentally ill; or - physically ill. (Section 29(2)(c)) Who can represent the party? - A person who is authorised in writing by the party; or - A person who is approved by the CDRT. PRIVATE PROCEEDINGS All proceedings in the CDRT are heard in camera (section 22(1)). This means that only the parties to the proceedings and the witnesses who have been called to give evidence in the proceedings are allowed to be present. Unless the Tribunal Judge orders otherwise, the following persons are not allowed to be present during the proceedings: a. Members of the press; b. Members of the public; and c. Immediate family members, relatives and friends of the parties to the proceedings who are not parties to the proceedings and have not been called to give evidence in the proceedings. SIMPLIFIED EVIDENTIAL RULES The CDRT is not bound by the rules of evidence but may inform itself on any matter in such manner as it thinks fit (section 23(1)). Evidence tendered to the CDRT by or on behalf of a party to any proceedings need not be given on oath but the CDRT may, at any stage of the proceedings, require that the evidence or any part of it be given on oath whether orally or in writing (section 23(2)), or be verified by statutory declaration (section 23(4)). SIMPLIFIED METHODS OF SERVICE Documents that are used in the CDRT proceedings can be served on the other party in the following simplified ways: METHOD OF SERVICE EXPLANATION Personal service Handing the documents to the party to be served Registered post to the residential address, registered address or address of the person’s principal place of business, as notified to ACRA Posting the documents to the address of the party to be served By submitting through the electronic system Serving electronically via the Community Justice &amp; Tribunals System (CJTS) where the other party has been notified of the right to access CJTS As directed by the CDRT In a manner that is directed by the CDRT COMPULSORY COUNSELLING AND MEDIATION At any point during the proceedings, the CDRT can order parties to the proceedings to attend counselling by a court counsellor or external counsellor, or mediation at the Community Mediation Centre or before any other mediator. A party who fails to comply with the order to attend counselling or mediation commits contempt of court, and may be fined or imprisoned. COSTS AND DISBURSEMENTS Other than disbursements, the CDRT will generally not grant costs to or award costs against any party to any proceedings in the CDRT (section 25). The only exception is where: a) The whole or any part of a claim is struck out or dismissed on the ground that the whole or part of the claim is frivolous or vexatious or is an abuse of the process of the CDRT; or b) The CDRT is of the view that it is just and equitable to do so. 2-Year Limitation Period for Claims All CDRT claims must be filed within 2 years from the date the cause of action accrued (section 17(3)). A cause of action is the fact or facts which entitles you, in law, to start a court action against the neighbour respondent. You may file a claim in the civil courts, e.g. at the Magistrate’s courts if the cause of action accrued more than 2years ago. Maximum $20,000 Monetary Claims The maximum monetary claim that can be brought in the CDRT is $20,000 (section 17(5)). You may file a claim in the civil courts, e.g. at the Magistrate’s courts if you are claiming more than $20,000 from the neighbour respondent."
}
,{
"title": "(E) Instructions in Filing Documents And Evidence",
"url": "/01-general-information.html#e-instructions-in-filing-documents-and-evidence",
"text": "(E) Instructions in Filing Documents And Evidence Every page must be paginated (i.e. numbered) consecutively, with the page number stated at the top right hand corner of the page. All documents which are not written in English must be accompanied by an official translation into English. Where the evidence is in the form of audio or video recordings (including CCTV recordings): (i) the recordings must be saved in a CD-R or DVD-R, which is labelled in the following format: [Party’s name]–[CD–R or DVD–R Number] E.g. [Tan Ah Teck Joseph]–[CD1] [Tan Ah Teck Joseph]–[DVD1] (ii) each recording must be saved under a file name in the following format: [Date of recording in Date Month Year format]–[Actual time that recording started in HH–MM–SS format]–[Short description of what the recording is meant to show] E.g. [05 June 2016]–[23–11–00]–[Spitting] [10 June 2016]–[09–07–00]–[Scolding vulgarities] (iii) the important part(s) of each recording that the party wishes to bring to the Tribunal Judge’s attention must be identified and transcribed in the following format in the Claim/Application/Reply: DVD Label File name of recording Time location within recording [HH:MM:SS] to [HH:MM:SS] Transcript* [Tan Ah Teck Joseph]–[DVD1] [05 June 2016]–[23-11-00]–[Spittinzg] Actual time: [23:11:23] to [23:11:30] or Recording time: [01:05:22] to [01:05:25] Respondent spits along the common corridor [Tan Ah Teck Joseph]–[DVD2] [10 June 2016]–[09-07-00]–[Scolding vulgarities] Actual time: [09:10:22] to [09:12:50] or Recording time: [00:35:21] to [00:40:23] Respondent stands outside Plaintiff’s flat and scolds Plaintiff vulgarities (“state exact words”) (iv) a transcript of the important part(s) of the audio or video recording must be preparedto state the action that is seen, the exact words that are used, the sounds that are heard etc. (v) where the words that are used in the audio or video recording are not in English, an official translation of the words into English must be provided. (vi) screenshots of the important frame(s) in the video recording to support what is stated in the transcript must be provided. IMPORTANT: DOCUMENTS AND EXHIBITS WHICH DO NOT COMPLY WITH THESE INSTRUCTIONS MAY BE REJECTED BY THE CDRT."
}
,{
"title": "Chapter 2: CDRT Proceedings",
"url": "/02-CDRT-proceedings.html",
"text": "Chapter 2: CDRT Proceedings"
}
,{
"title": "(A) Filing a Claim or Reply",
"url": "/02-CDRT-proceedings.html#a-filing-a-claim-or-reply",
"text": "(A) Filing a Claim or Reply Legal proceedings are commenced in the CDRT when a plaintiff files a claim against a respondent (section 4). Please see below for a step-by-step process on filing a claim in the CDRT. Step 1: Consider whether your neighbour has interfered with your enjoyment or use of your place of residence according to the CDRA. Step 2: Gather the necessary evidence to support your case. Step 3: For the purpose of the proceedings, you will be known as the Plaintiff and your neighbour will be known as the Respondent. Step 4: Upon filing the application in CJTS, a Notice of Pre-Trial Conference will be generated in CJTS and issued to the Plaintiff and the Respondent to attend a PreTrial Conference at the CDRT on a specified date and at a specified time Step 5: Within 14 days after the Claim is filed, the Plaintiff must serve one (1) set of the claim and one (1) set of the supporting evidence on the Respondent. E.g. If the Plaintiff files the Claim on 5 February 2018, the Plaintiff must serve one (1) set of the claim and one (1) set of the supporting evidence on the Respondent by 19 February 2018 which is the last day to serve the documents Step 6: Before the date and time fixed for the Pre-Trial Conference at the CDRT, the Plaintiff must file a Declaration of Service in CJTS. Step 7a: If the Respondent intends to object to or contest the claim, the Respondent has 14 days after being served with the claim and the supporting evidence to file his Reply, together with the supporting evidence, in CJTS. E.g. If the Respondent receives the claim and the supporting evidence from the Plaintiff on 11 February 2018, the Respondent must file his Reply, together with the supporting evidence, by 25 February 2018 at the latest. If the last day of the period is a Sunday or a Public Holiday, the period will include the next working day. Step 7b: Alternatively the Respondent may wish to consider resolving the matter via e-Negotiation in CJTS. Step 8: Within the same 14-day period, the Respondent must serve one (1) set of the Reply and one (1) set of the supporting evidence on the Plaintiff. Step 9: If parties are not able to explore a resolution via e-Negotiation in CJTS, the Plaintiff and the Respondent must attend the Pre-Trial Conference at the CDRT on the specified date and the specified time. Things to bring: 1) National Registration Identity Card (for Singapore citizen/Permanent Resident) 2) Passport and Employment Pass (for foreign citizen) 3) One (1) set of the Claim, Reply and supporting evidence 4) Notice of Pre-Trial Conference The Tribunal Judge can make the following orders during a Pre-Trial Conference: 1) Order the Plaintiff and the Respondent to attend mediation 2) Order the Plaintiff and/or the Respondent to attend counselling 3) Schedule another Pre-Trial Conference 4) Fix the case for hearing Step 10: Where the Tribunal Judge has fixed the case for hearing, a Notice of Hearing will be issued to the Plaintiff and the Respondent to attend the hearing at the CDRT on a specified date and time. Step 11: The Plaintiff and the Respondent must attend the hearing at the CDRT on the specified date and time. Things to bring: 1) National Registration Identity Card (for Singapore citizen/Permanent Resident) 2) Passport and Employment Pass (for foreign citizen) 3) One (1) set of the Claim, Reply and supporting evidence 4) Notice of Pre-Trial Conference If a Court Order is made, the Plaintiff is to extract the Court Order and serve a copy on the Respondent."
}
,{
"title": "(B) Enforcing CDRT Orders",
"url": "/02-CDRT-proceedings.html#b-enforcing-cdrt-orders",
"text": "(B) Enforcing CDRT Orders (i) APPLYING FOR A SPECIAL DIRECTION The Plaintiff may consider applying for a Special Direction against the Respondent (section 6). A Special Direction is a direction by the CDRT to the Respondent to comply with the order that has been made against him within a specified time. A Respondent who, without reasonable excuse, fails to comply with a Special Direction commits an offence and shall be liable on conviction to a fine up to $5,000 or to imprisonment of up to 3 months or to both (section 7(1)). ii) APPLYING FOR A PERSON TO ENTER INTO A COMPLIANCE BOND The Plaintiff may, at the same time as applying for a Special Direction, apply for a third party to enter into a Bond to ensure that the Respondent complies with the Special Direction (section 6(3)). The application is to be served on the third party to attend the proceedings and be heard before deciding whether to order him or her to enter into a Bond (section 6(5)). The CDRT may, in making an order for a third party to be bonded, impose conditions or give directions to the third party (section 6(4)). A party who fails to comply with a court order to enter into a Bond commits an offence and shall be liable on conviction to a fine of up to $2,000 (section 6(7)). If the Respondent fails to comply with the Special Direction, the CDRT will arrange for the third party to show cause why his Bond should not be forfeited. If cause is shown (i.e. the third party has provided sufficient explanation), the Bond may not be forfeited in full. If cause is not shown, the bond will be forfeited in full. (iii) APPLYING FOR AN EXCLUSION ORDER In the event that the Respondent still does not comply with the Special Direction, the Plaintiff may consider applying for an Exclusion Order against the Respondent (section 9). An Exclusion Order is an order by the CDRT that the Respondent be excluded from his or her place of residence. In deciding whether it is just and equitable (section 5(2)) for an exclusion order to be made, the CDRT must consider all of the following matters (section 9(4)): a) The impact of the order on the Respondent; b) The impact of the order on any person who, at the time of the making of the order, resides in the Respondent’s place of residence; c) The impact of the order on any other person who can reasonably be expected to be affected by the order; and d) Any other matters as the court deems fit. A Respondent who, without reasonable excuse, fails to comply with an Exclusion Order commits an offence and shall be liable on conviction to a fine up to $5,000 or to imprisonment of up to 3 months or to both (section 10(1)). Instead of a fine or imprisonment, the court also has the discretion to make a Community Order against the Respondent. The Respondent may, alternatively, be punished for Contempt of Court. (iv) CONTEMPT OF COURT The Respondent may be punished for Contempt of Court. The fundamental purpose underlying the law relating to contempt of court in general is to ensure that public confidence in the administration of justice is not undermined. The court may sentence the Respondent to both a fine as well as imprisonment."
}
,{
"title": "(C) Appeals",
"url": "/02-CDRT-proceedings.html#c-appeals",
"text": "(C) Appeals (i) APPEALS FROM ORDER OF CDRT REGISTRAR Rule 15 of the CDRA Rules provides that an appeal may be made to a Tribunal Judge from any judgment, order or direction of the Registrar. The appeal is brought by serving on the other party a notice filed in the relevant form to attend before the Tribunal Judge. Unless the Court otherwise orders, the notice must be issued within 14 days after the judgment, order or direction appealed against was given or made and served on all other parties within 7 days of it being issued. Except so far as the Court may otherwise direct, an appeal under this Rule shall not operate as a stay of the proceedings in which the appeal is brought. (ii) APPEALS TO HIGH COURT An appeal can be made to the High Court against a decision, a direction or an order of a CDRT: (a) On any ground involving a question of law; (b) On the ground that the claim was outside the jurisdiction of the tribunal; (c) Made under section 6(2) (i.e. Special Direction); (d) Made under section 6(3) (i.e. Bond); (e) Made under section 9(2) (i.e. Exclusion Order); or (f) A final order (i.e. an order that finally disposes of the case). Such an appeal can be made to the High Court only if the CDRT has given leave to do so. The CDRT’s order giving or refusing leave to appeal is final and is not subject to any appeal. (iii) APPLICATION FOR LEAVE TO APPEAL An application for leave to appeal against a decision, a direction or an order of the CDRT must be made in the relevant form and must be filed within 14 days after the date on which the decision, direction or order was given or made. The Appellant must serve the application on the Respondent within 7 days after the date on which the application is filed. A Respondent who intends to contest the application must file and serve on the Appellant a reply in the relevant form within 14 days after being served with the application. Where any party does not appear at the hearing of the application for leave to appeal, the CDRT hearing the application may dismiss the application or make such orders as the tribunal thinks fit. (iv) IF LEAVE TO APPEAL IS GRANTED An Appellant who obtains leave to appeal from a CDRT must file and serve a notice of appeal in the relevant form within 14 days after the date on which such leave is given. An appeal to the High Court from the CDRT is by way of rehearing. The Appellant must, at the time of filing the notice of appeal, provide security for the Respondent’s costs of the appeal in the sum of $2,000."
}
,{
"title": "Chapter 3: Case Summaries / Orders",
"url": "/03-case-summaries-orders.html",
"text": "Chapter 3: Case Summaries / Orders The following community disputes case studies are provided as a guide to court users and to illustrate the types of Court Orders the Judge made for each of the cases. The case details have been generalised to ensure confidentiality of the CDRT hearings which are private proceedings. Court users can have an understanding of the types of cases that have been heard at the CDRT, and the considerations that shape the outcome of the hearings. The facts and circumstances of each case will vary. The Judge will consider all the relevant factors before making the CDRT orders."
}
,{
"title": "(A) Consent Order",
"url": "/03-case-summaries-orders.html#a-consent-order",
"text": "(A) Consent Order The following Consent Court Order cases show how parties were able to agree to an amicable order by the CDRT despite the seemingly intractable issues facing the parties. Mediated solutions help to preserve good neighbourly relations. The Consent Orders show how the concerns of both parties may be addressed and serve as a guide for parties to consider how to resolve similar neighbourhood disputes. (i) Section 4(2)(a) Causing excessive noise KARAOKE WOES The Plaintiff’s flat is directly above the Respondent’s flat in a HDB block. The Plaintiff alleged that the Respondent created excessive noise whenever he and his family members used their karaoke machine. As a result of the ongoing dispute, the Respondent scolded the Plaintiff and the Plaintiff’s family members with vulgarities and abusive words. The Respondent intentionally left his main door and windows open while using the karaoke machine in order to antagonise the Plaintiff. CONSENT ORDER The Respondent shall ensure that whenever he or any of the occupants of his flat use the karaoke machine, all windows and doors in the flat will be closed completely in order to reduce the amount of sound that escapes his flat. The Respondent shall not use the karaoke machine in the periods that the occupants of the Plaintiff’s flat are having exams, provided that the Plaintiff or any of the occupants of her flat informs the Respondent in person of the said exam periods. The Respondent and the Plaintiff, as well as their family members, shall not approach each other, except for the Plaintiff to inform the Respondent of the exam periods. The Respondent and the Plaintiff, as well as their family members, shall not stare at each other in the event that they meet each other. The Respondent and the Plaintiff, as well as their family members, shall not make any abusive or insulting comments and sounds at each other. The Respondent and the Plaintiff, as well as their family members, shall not use any abusive or insulting gestures or behaviour at each other. (ii) Section 4(2)(b) Littering at or in the neighbour’s residence; Section 4(2)(e) Surveillance of neighbour or neighbour’s residence DIRT, DUST, MOTHBALLS &amp; INSULTS The Plaintiff and Respondent are adjacent neighbours in a private condominium. The common corridor on the 3rd floor branches out to two staircases leading to the Plaintiff’s unit and the Respondent’s unit. There is a staircase landing in front of the main door of each unit. The Plaintiff and the Respondent admitted that the staircase landing and staircases constitute common property. The Plaintiff alleged that the Respondent and his family members caused him unreasonable interference in the following ways: dusting their floor mat, brushing their dirty shoes and throwing dust and other items onto the common corridor and common staircases - placing mothballs at the staircase landing outside the main door of the Respondent’s unit which the Plaintiff considered to be a health hazard using insulting or rude comments and gestures towards the Plaintiff. regularly video-recording the movements of him and his family members using a CCTV camera which is focused on the staircase leading to the Respondent’s unit and the staircase landing outside the main door of the Respondent’s unit using a mobile phone to record the Respondent and his family members at the common areas of condominium and at the Respondent’s workplace. CONSENT ORDER The Respondent and his family members shall not deposit or throw on the common property of the condominium any rubbish, dirt, dust, or other material or discarded item. In particular, the Respondent and his family members shall not hang any floor mat on any part of the railing outside their unit and shall not dust their shoes or throw any item in or around the staircase landing outside the main door of the unit and the staircases and common corridors around or leading to their unit and the Plaintiff’s unit. The Respondent shall ensure that all mothballs at the staircase landing outside the main door of the Respondent’s unit are removed within 3 working days after the making of the order. The Plaintiff shall not focus the CCTV camera at the main door of the Respondent’s unit, the staircase landing outside the Respondent’s unit or the staircase leading to the Respondent’s unit. The Plaintiff shall focus the CCTV camera at the staircase landing outside the main door of the Plaintiff’s unit and the top half of the staircase leading to the Plaintiff’s unit. On the understanding that the Respondent and his family members abide by the terms of this order, the Plaintiff shall cease the taking of any photographs or videos of the Respondent or any of his family members, whether in or outside the condominium. The Plaintiff and the Respondent (and their family members) shall not engage in any physical encounters with each other if they should coincidentally meet each other in the common areas of the condominium. The Plaintiff and the Respondent (and their family members) shall not use any threatening, abusive or insulting words or behaviour against each other or within the hearing of each other. The Plaintiff and the Respondent (and their family members) shall not approach the staircase landing outside the main door of each other’s apartment, except in times of an emergency. The Respondent (and his family members) shall not throw anything into the Plaintiff’s unit. (iii) Section 4(2)(b) Littering at or in the vicinity of neighbour’s residence; Section 4(2)(d) Interfering with neighbour’s movable property ABUSE AND RUBBISH The Plaintiff and the Respondent live in flats located along the same common corridor. The Respondent who was diagnosed with Schizophrenia lived with his two children. While the Respondent’s children were at work and the Respondent was home alone, he repeatedly threw food items, food waste, food wrappers, incense ash, unknown liquids, crushed newspapers and other objects along the common corridor outside the Plaintiff’s flat and at the gate and door of the Plaintiff’s flat. The Respondent also used objects such as umbrellas and scissors to hit the windows, gate and main door of the Plaintiff’s flat, causing some minor damage. In addition, the Respondent repeatedly loitered along the common corridor outside the Plaintiff’s flat and scolded, cursed and made highly abusive or insulting comments about the Plaintiff and the Plaintiff’s family in a very loud voice. The Respondent also stalked the Plaintiff and the Plaintiff’s family members. Due to the Respondent’s psychiatric condition, the Respondent was represented in the proceedings by one of the Respondent’s children. CONSENT ORDER The Respondent is prohibited from stopping along the common corridor outside the Plaintiff’s flat with the intention of irritating, provoking or disturbing the Plaintiff or the residents in the Plaintiff’s flat. The Respondent is prohibited from talking loudly or making noises along the common corridor outside the Plaintiff’s flat with the intention of irritating, provoking or disturbing the Plaintiff or the residents in the Plaintiff’s flat. The Respondent is prohibited from throwing food, food particles, food wrappers, dust, dirt or any other article or thing at, into or outside the Plaintiff’s flat. The Respondent is prohibited from interfering with the Plaintiff’s flat, including using her hand, body, objects or any other means to hit the gate, doors, windows or walls of the Plaintiff’s flat, spraying or throwing water or any other substance onto the gate, doors, windows or walls of the Plaintiff’s flat and kicking objects (including footwear belonging to the the Plaintiff’s neighbours) along the common corridor in front of the Plaintiff’s flat. The Respondent is prohibited from interfering with any movable property belonging to the Plaintiff or the residents in the Plaintiff’s flat that is placed at or in the vicinity of the Plaintiff’s flat, including the common corridor outside the Plaintiff’s flat. The Plaintiff and the Respondent (and the residents of their flats) are prohibited from approaching each other. The Plaintiff and the Respondent (and the residents of their flats) are prohibited from using any threatening, abusive or insulting words or behaviour against each other."
}
,{
"title": "(B) Adjudicated Order",
"url": "/03-case-summaries-orders.html#b-adjudicated-order",
"text": "(B) Adjudicated Order Sometimes the parties are unable to agree to a Consent Order. The Court will proceed to hear the case and make the Orders based on the facts of the case. (i) Section 4(2)(c) Obstructing neighbour’s place of residence MY SPACE YOUR SPACE The Plaintiff and the Respondent are adjacent neighbours in an HDB block. The Respondent’s flat is a corner unit, while the Plaintiff’s flat is on the left of the Respondent’s flat. There is a sliding window (belonging to the Plaintiff’s flat) between the main entrance of the Respondent’s flat and the main entrance of the Plaintiff’s flat. The Respondent placed a metal shoe rack, a red metal incense burner, a bicycle and some other miscellaneous items under the Plaintiff’s sliding window. After the Plaintiff sought the Town Council’s assistance, the Town Council officer instructed the Respondent to remove the bicycle, which he did. According to the Plaintiff and the Respondent, the Town Council told the Respondent that he could continue placing the metal shoe rack below the Plaintiff’s window. During court proceedings, the Plaintiff and the Respondent did not exhibit any written permission from the Town Council to that effect. The Plaintiff sought an order for the Respondent to remove all items at the common corridor, in particular, the items below the Plaintiff’s window. ORDER After hearing both parties, a Tribunal Order was made against the Respondent to remove all the Respondent’s items outside the corridor of the Plaintiff’s flat Grounds for Order The items placed outside the Plaintiff’s flat interfered with the Plaintiff’s enjoyment of her premises, when the Plaintiff goes in and out of her flat and when the Plaintiff opens her window. The items prevented the Plaintiff from cleaning her windows and surroundings. Each flat owner has the right to the space inside the flat but not outside the flat where the common corridor is located. The common corridor falls under the purview of the Town Council. In this case, there was a Town Council By-Law that stated that no one shall obstruct or cause or permit the obstruction of the lawful use of the common property with any object, fixture or thing. The Respondent was at liberty to keep the shoe rack inside the Respondent’s flat. The Plaintiff requested for and the Respondent was ordered to pay the disbursements for the CDRT filing fees and IRAS search fee to obtain the Respondent’s name to file the claim."
}
,{
"title": "(C) Dismissal",
"url": "/03-case-summaries-orders.html#c-dismissal",
"text": "(C) Dismissal a) Section 4(2)(a) Causing excessive noise BABYSITTING BLUES The Plaintiff’s flat was directly below the Respondent’s flat. The Plaintiff alleged that the Respondent made excessive noises which were described as heavy running, stomping and thumping, dragging of furniture and dropping of items onto the floor. The occurrence of the noises coincided with the presence of the Respondent’s two year old granddaughter, for whom the Respondent was the main caregiver while the girl’s parents were at work. The Respondent’s case was that any noises that might have been generated were reasonable noises associated with the movements and activities of a young child in a home setting. As the parties could not settle the dispute through mediation, the case proceeded for trial. Case Dismissed At the end of the trial, the Plaintiff’s Claim was dismissed as he had not proven on a balance of probabilities that the noises that he had been hearing in his flat had originated from the Respondent’s flat alone and that it was the Respondent or her family members who had caused the noises intentionally, recklessly or negligently. There was also no evidence to suggest that the noises were “excessive” in that they exceeded household noises or lifestyle noises that are generated through ordinary instances of daily living that can be expected to be tolerated by reasonable persons living in Singapore, and that the noises caused “unreasonable interference” to the Plaintiff’s use or enjoyment of his flat."
}
,{
"title": "(D) Withdrawal",
"url": "/03-case-summaries-orders.html#d-withdrawal",
"text": "(D) Withdrawal (i) Section 4(2)(a) Causing excessive noise ELDERLY RELATIVES The Plaintiff’s flat was directly below the Respondent’s flat. The Plaintiff alleged that every morning from about 6.45am to 8.15am, she would hear noises from the Respondent’s flat, including slamming of the door, sliding and slamming of the window grilles, sounds of footwear and sounds of dragging of furniture in the living room. At the first Pre-trial Conference (PTC), the CDRT Judge was informed that the Respondent lived with her uncle and her elderly aunts and that all the ladies wore slippers at home to protect their feet against the coldness of the floor. The CDRT Judge was also informed that the uncle and elderly aunts woke up early every morning, which coincided with the period that the Plaintiff heard the noises. The elderly aunts also did their laundry and hung them out to dry at about 6–7am. In addition, the sliding aluminium window grilles were more than 15 years old. During the case management session, the CDRT Judge explored with the Respondent on what the possible causes of the noises were and how they could be remedied. The Respondent agreed to do the following: Explore alternative footwear for herself and her aunts. Replace the stoppers at the base of all the dining chairs in the flat to those that were of softer material and provided more cushioning. For the aunts to do the laundry and hang out the laundry at a later time. When parties returned for the second PTC, the Plaintiff informed the CDRT Judge that the footwear noises had totally disappeared and the noise from the dragging of furniture had reduced, although the noise from the sliding of the window grilles was still present. The Respondent agreed to purchase lubricant for the window grilles to reduce the friction whenever they were opened or closed. As a result of the improvement to the noises and in the spirit of good neighbourliness, the Plaintiff withdrew the Claim."
}
,{
"title": "Chapter 4: Frequently Asked Questions",
"url": "/04-frequently-asked-questions.html",
"text": "Chapter 4: Frequently Asked Questions"
}
,{
"title": "1. What will the CDRT consider in deciding whether to make a court order and what court order to make?",
"url": "/04-frequently-asked-questions.html#1-what-will-the-cdrt-consider-in-deciding-whether-to-make-a-court-order-and-what-court-order-to-make",
"text": "1. What will the CDRT consider in deciding whether to make a court order and what court order to make? The CDRT will consider: Whether the claim has been made out against your neighbour on a balance of probabilities; and Whether it is just and equitable for an order to be made. In deciding whether it is just and equitable for the court order to be made, the CDRT will consider: The impact of the order on your neighbour; The impact of the order on any person who resides in your neighbour’s place of residence at the time the order is made; The impact of the order on any other person who can reasonably be expected to be affected by the order; The ordinary instances of daily living that can be expected to be tolerated by reasonable persons living in Singapore; and Any other matters as the CDRT deems fit."
}
,{
"title": "2. What can I do if my neighbour refuses to comply with the court order?",
"url": "/04-frequently-asked-questions.html#2-what-can-i-do-if-my-neighbour-refuses-to-comply-with-the-court-order",
"text": "2. What can I do if my neighbour refuses to comply with the court order? What happens when my neighbour refuses to comply with: What action can I take under CDRA? Court order Apply for a Special Direction for your neighbour to comply with the court order Special Direction File a Magistrate’s Complaint against your neighbour to privately prosecute him for breach of the Special Direction under Section 7(1) of the CDRA; or Start contempt of court proceedings against your neighbour; or Apply for an Exclusion Order against your neighbour Exclusion Order File a Magistrate’s Complaint against your neighbour to privately prosecute him for breach of the Exclusion Order under Section 10(1) of the CDRA; or Start contempt of court proceedings against your neighbour"
}
,{
"title": "3. What can I do if I know my neighbour’s address but do not know my neighbour’s name?",
"url": "/04-frequently-asked-questions.html#3-what-can-i-do-if-i-know-my-neighbours-address-but-do-not-know-my-neighbours-name",
"text": "3. What can I do if I know my neighbour’s address but do not know my neighbour’s name? You can conduct an ownership search based on your neighbour’s address at the following websites: Income Tax Revenue Authority of Singapore website: e-Valuation List https://mytax.iras.gov.sg/ESVWEB/default.aspx?target=PTEVLListIntro Singapore Land Authority website: Integrated Land Information Service https://www.sla.gov.sg/inlis/ Please note that these websites provide the name of the legal owner and not the name of the tenant(s) that the legal owner may have leased the property to."
}
,{
"title": "4. I am a bankrupt. Can I file a Claim or a Reply?",
"url": "/04-frequently-asked-questions.html#4-i-am-a-bankrupt-can-i-file-a-claim-or-a-reply",
"text": "4. I am a bankrupt. Can I file a Claim or a Reply? You can file a Claim or a Reply provided you have obtained the previous sanction of the Official Assignee under section 131(1)(a) of the Bankruptcy Act. Bankruptcy Act (Cap. 20) Disabilities of bankrupt 131.— (1) Where a bankrupt has not obtained his discharge — (a) he shall be incompetent to maintain any action, other than an action for damages in respect of an injury to his person, without the previous sanction of the Official Assignee; and (b) he shall not leave, remain or reside outside Singapore without the previous permission of the Official Assignee. (2) A bankrupt who fails to comply with this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. *The sanction has to be uploaded under Other Supporting Documents of the Claim or the Reply."
}
,{
"title": "5. Why is the first Pre-Trial Conference fixed in 4 weeks from date of filing a Claim?",
"url": "/04-frequently-asked-questions.html#5-why-is-the-first-pre-trial-conference-fixed-in-4-weeks-from-date-of-filing-a-claim",
"text": "5. Why is the first Pre-Trial Conference fixed in 4 weeks from date of filing a Claim? Rule 5(2) states that the Plaintiff has 2 weeks after filing the Claim and supporting evidence to serve the documents on the Respondent. Rule 5(4) states that the Respondent has 2 weeks after being served to file a copy of the Reply and supporting evidence and serve a copy of the documents on the Plaintiff. Therefore, the Pre-Trial Conference date will be fixed in 4 weeks from date of filing a Claim."
}
,{
"title": "6. What if the Respondent does not attend Pre-Trial Conference?",
"url": "/04-frequently-asked-questions.html#6-what-if-the-respondent-does-not-attend-pre-trial-conference",
"text": "6. What if the Respondent does not attend Pre-Trial Conference? The CDRT may grant a default order in the absence of the Respondent."
}
,{
"title": "7. Is it compulsory to attend mediation?",
"url": "/04-frequently-asked-questions.html#7-is-it-compulsory-to-attend-mediation",
"text": "7. Is it compulsory to attend mediation? It is compulsory to attend any mediation that is ordered by the CDRT. You are liable for contempt of court if you are absent from mediation."
}
,{
"title": "8. What happens if the dispute is settled at mediation?",
"url": "/04-frequently-asked-questions.html#8-what-happens-if-the-dispute-is-settled-at-mediation",
"text": "8. What happens if the dispute is settled at mediation? If the dispute is settled, parties may sign a settlement agreement, after which the Plaintiff will withdraw the Claim. Alternatively, parties may request the CDRT to record the settlement terms into a consent order."
}
,{
"title": "9. What happens if the dispute is not settled at mediation?",
"url": "/04-frequently-asked-questions.html#9-what-happens-if-the-dispute-is-not-settled-at-mediation",
"text": "9. What happens if the dispute is not settled at mediation? The Plaintiff and Respondent are to attend a Pre-Trial Conference for further directions."
}
,{
"title": "10. What do I need to prepare for the CDRT hearing?",
"url": "/04-frequently-asked-questions.html#10-what-do-i-need-to-prepare-for-the-cdrt-hearing",
"text": "10. What do I need to prepare for the CDRT hearing? You will need to follow the CDRT’s directions to prepare for the hearing."
}
,{
"title": "11. What if my witness refuses to attend the CDRT hearing?",
"url": "/04-frequently-asked-questions.html#11-what-if-my-witness-refuses-to-attend-the-cdrt-hearing",
"text": "11. What if my witness refuses to attend the CDRT hearing? You may make an application to the CDRT to order the witness to attend the hearing. This is subject to the CDRT’s approval. You will have to bear the cost of the witness’s attendance and testimony at the hearing, if any."
}
,{
"title": "12. What happens at the hearing?",
"url": "/04-frequently-asked-questions.html#12-what-happens-at-the-hearing",
"text": "12. What happens at the hearing? The hearing will proceed as directed by the CDRT. In the usual case, the Plaintiff will give his evidence, followed by his witnesses. After the Plaintiff and all his witnesses have given their evidence, the Respondent will give his evidence, followed by his witnesses. The Plaintiff and Respondent will be given the opportunity to crossexamine the other party’s witnesses. At the end of the hearing, the CDRT may give its order immediately or reserve its order to be given on a different date."
}
,{
"title": "13. What happens if the Respondent does not comply with the CDRT order?",
"url": "/04-frequently-asked-questions.html#13-what-happens-if-the-respondent-does-not-comply-with-the-cdrt-order",
"text": "13. What happens if the Respondent does not comply with the CDRT order? The Plaintiff may take steps to enforce the CDRT order. Please refer to Chapter 2 on how to Enforce CDRT Orders."
}
,{
"title": "Chapter 5: Court Fees",
"url": "/05-court-fees.html",
"text": "Chapter 5: Court Fees"
}
,{
"title": "Court Fees",
"url": "/05-court-fees.html#court-fees",
"text": "Court Fees The Court fees that will be charged for CDRT proceedings are shown below: COMMUNITY DISPUTES RESOLUTION ACT 2015 COMMUNITY DISPUTES RESOLUTION TRIBUNALS RULES 2015 RULE 19 19.– (1) The fees in the First Schedule are payable for proceedings in the Community Disputes Resolution Tribunals, in addition to the fees and percentages in Appendix B to the Rules of Court (Cap. 322, R 5). (2) The scale of fees and percentages in Appendix B to the Rules of Court which applies to any cause or matter in the Community Disputes Resolution Tribunals is the scale applicable to a District Court. COURT FEES No. Item Fee CDRT Rules First Schedule Item No. Document to be stamped and remarked 1 On filing a claim under rule 5. $150 1 The filed copy 2 On filing an application under rule 9 for a special direction, or under rule 11 for an exclusion order. $100 2 The filed copy 3 On filing an application under rule 10 for an order for a person to enter into a bond. $100 3 The filed copy 4 On filing a reply to — (a) a claim under rule 5 (b) an application under rule 9 for a special direction (c) an application under rule 10 for an order for a person to enter into a bond (d) an application under rule 11 for an exclusion order. (e) an application under rule 14 to set aside a judgement, an order or a direction given or made by a tribunal or the Registrar (f) an application under rule 16 for leave to appeal against a decision, a direction or an order of a tribunal $20 4 The filed copy 5 On filing an application under section 29(2) of the Act for a person, or under section 29(3) of the Act for an advocate and solicitor, to represent a party to proceedings before the Registrar or a Community Disputes Resolution Tribunal. $10 5 The filed Copy 6 On entering or sealing a judgment or an order of the Registrar or a Community Disputes Resolution Tribunal. $30 6 Order or Judgement 7 On filing an application to set aside a judgment, an order or a direction of the Registrar or a Community Disputes Resolution Tribunal. $100 7 The filed copy 8 On filing a notice of appeal from the Registrar to a Tribunal Judge of the Community Disputes Resolution Tribunal. $100 8 The Notice 9 On filing an application for leave to appeal to the High Court. $100 9 The filed copy 10 On filing a notice of appeal to the High Court. $600 10 The Notice RULE 20 COURT HEARING FEES No. Description Hearing Fee CDRT Rules 2nd Schedule Item No. Document to be stamped and remarks 1 For the whole or part of each of the second and third days $100 1 Request 2 For the whole or part of each day after the third day $250 2 Request"
}
,{
"title": "Chapter 6: Sample Information for Filing",
"url": "/06-sample-information-for-filing.html",
"text": "Chapter 6: Sample Information for Filing"
}
,{
"title": "Sample Information for Claims",
"url": "/06-sample-information-for-filing.html#sample-information-for-claims",
"text": "Sample Information for Claims All claims must be filed online through the Community Justice and Tribunals System (CJTS) from 5 February 2018. Here are examples of the types of information required when filing online. You will need to complete the forms according to your own case. The examples given are in Blue text. You may file your information according to the fields allocated. To submit fuller details, pictures or photos, please pdf the document and upload it onto the CJTS."
}
,{
"title": "A Guide to Neighbour Dispute Claims",
"url": "/",
"text": "A Guide to Neighbour Dispute Claims ​Note: The Subordinate Courts were renamed “State Courts” on 7 March 2014. Unless otherwise stated, the processes and procedures remain unchanged. Where reference is made to “Subordinate Courts” in any subsidiary legislation, contract, deed or document, it shall be read as a reference to the “State Courts”, unless the context states otherwise."
}
]